// 6. Написать программу вычисления знвчения функции y = sin(a). (Класс math).

double a=Convert.ToDouble(Console.ReadLine());
double y=Math.Sin(a);
System.Console.WriteLine(y);